Revit 2026 API

# MaterialSmoothness Property

---

The smoothness of the material.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Smoothness { get; set; }
```
```vb
Public Property Smoothness As Integer
	Get
	Set
```
```cpp
public:
property int Smoothness {
	int get ();
	void set (int value);
}
```
```fsharp
member Smoothness : int with get, set
```

#### Property Value

Int32 The value ranges from 0 to 100.

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: values for shininess must be between 0 and 128 |

#### Reference

Material Class

Autodesk.Revit.DB Namespace